Autodesk.Revit.DB.SiteLocation.CreateForLink(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.String)
Create a GeoSite for the specific linkType
document:
The document of the link.
linkTypeId:
The ElementId of the link where the new instance of SiteLocation would be created in.
geoSiteName:
The name of the instance of SiteLocation to be created.
geoCoordinateSystem:
The coordinate system
Returns:
The newly created instance of SiteLocation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element linkTypeId does not exist in the document
-or-
geoSiteName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019